<a href="https://colab.research.google.com/github/brunonbn/intro-data-science/blob/main/FormasSelecao.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [5]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (9, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [6]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

## Seleção de Coluna de um DataFrame

In [7]:
# retorna uma series com uma coluna específica do DataFrame
df['c1']

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [8]:
# retorna um DataFrame, mas com apenas 2 colunas e mudando a ordem entre elas
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

## Seleção de Linha de um DataFrame

### Usando os índices numéricos das linhas

In [9]:
# retornando um DataFrame filtrando a partir da linha 2 - zero based - linha 1 é 0, linha 2 é 1
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [10]:
# retornando um DataFrame filtrando a partir da linha 2 - linha 3 é 2
df[2:]

    c1  c2  c3  c4
l3   9  10  11  12
l4  13  14  15  16

In [11]:
# retornando uma DataFrame filtrando um intervalo entre 2 linhas
# lembrar que é zero based - o primeiro limite do intervalo inclui (1 - linha 2), mas o segundo limite não (3 - linha 4)
# é como se primeiro limite fosse um >= e o segundo forsse um < apenas
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [12]:
# é possível juntar a seleção de linhas com a seleção de colunas
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   9
l4  15  13

### Usando os rótulos das linhas

In [13]:
# ao contrário do índice numérico, o loc de uma linha retorna uma Series
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [14]:
type(df.loc['l3'])

pandas.core.series.Series

In [15]:
df[2:3]

    c1  c2  c3  c4
l3   9  10  11  12

In [16]:
type(df[2:3])

pandas.core.frame.DataFrame

In [17]:
# possível usar o loc para seleção de 2 linhas, alterando a ordem entre elas
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [20]:
# possível pegar um valor específico da matrix, passando a linha e a coluna no loc
df.loc['l2', 'c3']

7

In [21]:
# usando o iloc para usar o índice numérico na busca acima, no lugar dos rótulos de linha e coluna
# lembrando: tanto a linha quanto a coluna são zero based - então: l2 - índice 1 | c3 - índice 2
df.iloc[1, 2]

7

In [22]:
# fazendo a seleção de múltiplas linhas e múltiplas colunas
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   9
l1   4   1

In [23]:
# mesma seleção acima, usando iloc e índices numéricos
df.iloc[[2, 0], [3, 0]]

    c4  c1
l3  12   9
l1   4   1